GREETINGS = (
        "👋 Привет! Я бот для работы с твоими баллами ЕГЭ.\n\n"
        "Вот что я умею:\n"
        "1️⃣ /register — зарегистрироваться (ввести ваше имя и фамилию)\n"
        "2️⃣ /enter_scores — выбрать предмет и ввести балл\n"
        "3️⃣ /view_scores — посмотреть все ваши сохранённые баллы\n\n"
        "С чего начнём? Для регистрации введите команду /register."
    )

FIRST_NAME_MESSAGE = "Введите ваше имя"
SURNAME_MESSAGE = "Введите вашу фамилию"
REGISTRATION_END_MESSAGE = (
    "Регистрация завершена\n"
    "1️⃣ /enter_scores — выбрать предмет и ввести балл\n"
    "2️⃣ /view_scores — посмотреть все ваши сохранённые баллы\n\n"
    )
CHOOSE_SUBJECT = "Выберите предмет:"
TYPE_SCORE = "Введите ваши баллы"
WRONG_SCORE = "Балл должен быть числом от 0 до 100. Попробуйте снова."
SCORE_END_MESSAGE = (
    "Баллы сохранены\n"
    "1️⃣ /enter_scores — выбрать предмет и ввести балл\n"
    "2️⃣ /view_scores — посмотреть все ваши сохранённые баллы\n\n"
    )
NO_SCORES = "У вас ещё нет сохранённых баллов."
NO_REGISTRATION = "Ошибка. Возможно, вы ещё не зарегистрированы"
